ZEO/Zeo/Alloy/TCF.Zeo.Cxn.MoneyTransfer.WU/Service References/SendMoneyStore/SendMoneyStore_Service_H2H1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.westernunion.com/SendMoneyStore_H2H" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" name="SendMoneyStore_Service_H2H" targetNamespace="http://www.westernunion.com/SendMoneyStore_H2H" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema xmlns:mrm="http://www.westernunion.com/SendMoneyStore_H2H" targetNamespace="http://www.westernunion.com/SendMoneyStore_H2H">
      <xsd:import schemaLocation="../schema/XRSISendMoneyStoreReply.xsd" namespace="http://www.westernunion.com/schema/xrsi" />
      <xsd:import schemaLocation="../schema/XRSIErrorReply.xsd" namespace="http://www.westernunion.com/schema/xrsi" />
      <xsd:import schemaLocation="../schema/XRSISendMoneyStoreRequest.xsd" namespace="http://www.westernunion.com/schema/xrsi" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="SendMoneyStore_H2H_in">
    <wsdl:part name="send-money-store-request" element="xrsi:send-money-store-request" />
  </wsdl:message>
  <wsdl:message name="SendMoneyStore_H2H_out">
    <wsdl:part name="send-money-store-reply" element="xrsi:send-money-store-reply" />
  </wsdl:message>
  <wsdl:message name="SendMoneyStore_H2H_fault1">
    <wsdl:part name="error-reply" element="xrsi:error-reply" />
  </wsdl:message>
  <wsdl:portType name="SendMoneyStorePortType">
    <wsdl:operation name="SendMoneyStore_H2H">
      <wsdl:input name="SendMoneyStore_H2H_Input" message="tns:SendMoneyStore_H2H_in" />
      <wsdl:output name="SendMoneyStore_H2H_Output" message="tns:SendMoneyStore_H2H_out" />
      <wsdl:fault name="SendMoneyStore_H2H_Fault" message="tns:SendMoneyStore_H2H_fault1" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="SendMoneyStore_H2H_MSetSOAP_HTTP_Binding" type="tns:SendMoneyStorePortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="SendMoneyStore_H2H">
      <soap:operation soapAction="" />
      <wsdl:input name="SendMoneyStore_H2H_Input">
        <soap:body use="literal" parts="send-money-store-request" />
      </wsdl:input>
      <wsdl:output name="SendMoneyStore_H2H_Output">
        <soap:body use="literal" parts="send-money-store-reply" />
      </wsdl:output>
      <wsdl:fault name="SendMoneyStore_H2H_Fault">
        <soap:fault use="literal" name="SendMoneyStore_H2H_Fault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="SendMoneyStore_Service_H2H">
    <wsdl:port name="SOAP_HTTP_Port" binding="tns:SendMoneyStore_H2H_MSetSOAP_HTTP_Binding">
      <soap:address location="http://www.westernunion.com/SendMoneyStore_Service_H2H" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>