xmlsamples/PI_MTCN/KW-SMS-AIS.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:send-money-store-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
         <device>
            <id>GF</id>
            <type>RETAIL</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>UAE Exchange</name>
            <version>9500</version>
         </channel>
         <instant_notification>
            <addl_service_charges>0103D0102010030100103MSG02010030101103FEE1203100130310099200101C0211KWD0000590999210417wufxspd0001143579</addl_service_charges>
         </instant_notification>
         <sender>
            <name name_type="D">
               <first_name>SAI</first_name>
               <last_name>VISHNU KUWAIT</last_name>
            </name>
            <address>
               <addr_line1>FLAT NO 401 GIFT LAND BLDG,</addr_line1>
               <city>FARWANIYA</city>
               <country_code>
                  <iso_code>
                     <country_code>KW</country_code>
                     <currency_code>KWD</currency_code>
                  </iso_code>
                  <country_name>KUWAIT</country_name>
               </country_code>
               <address_type>I</address_type>
            </address>
            <compliance_details>
               <template_id>KWT_01_S</template_id>
               <id_details>
                  <id_type>A</id_type>
                  <id_country_of_issue>CHINA</id_country_of_issue>
                  <id_number>G12648267</id_number>
               </id_details>
               <third_party_details>
                  <flag_pay>N</flag_pay>
               </third_party_details>
               <id_issue_date>08112007</id_issue_date>
               <id_expiration_date>11112025</id_expiration_date>
               <date_of_birth>27111997</date_of_birth>
               <occupation>Software developers</occupation>
               <transaction_reason>Educational fees</transaction_reason>
               <Country_of_Birth>India</Country_of_Birth>
               <nationality>India</nationality>
               <Does_the_ID_have_an_expiration_date>Y</Does_the_ID_have_an_expiration_date>
               <ack_flag>X</ack_flag>
            </compliance_details>
            <phone_country_code>965</phone_country_code>
            <contact_phone>99352709</contact_phone>
            <date_of_birth>27111997</date_of_birth>
            <mobile_phone>
               <phone_number>
                  <country_code>965</country_code>
                  <national_number>99352709</national_number>
               </phone_number>
            </mobile_phone>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>SAI</first_name>
               <last_name>VISHNU</last_name>
            </name>
            <address>
               <addr_line1>TELENGANA</addr_line1>
               <city>HYD</city>
               <state>TELENGANA</state>
               <country_code>
                  <iso_code>
                     <country_code>BD</country_code>
                     <currency_code>BDT</currency_code>
                  </iso_code>
               </country_code>
               <address_type>B</address_type>
            </address>
            <mobile_phone>
               <phone_number>
                  <country_code>880</country_code>
                  <national_number>1234567890</national_number>
               </phone_number>
            </mobile_phone>
         </receiver>
         <promotions>
            <promo_sequence_no/>
            <promo_name/>
            <promo_message/>
            <sender_promo_code/>
         </promotions>
         <payment_details>
            <expected_payout_location/>
            <recording_country_currency>
               <iso_code>
                  <country_code>KW</country_code>
                  <currency_code>KWD</currency_code>
               </iso_code>
            </recording_country_currency>
            <destination_country_currency>
               <iso_code>
                  <country_code>BD</country_code>
                  <currency_code>BDT</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>KW</country_code>
                  <currency_code>KWD</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>FARWANIYA</originating_city>
            <originating_state>FAR</originating_state>
            <transaction_type>WMN</transaction_type>
            <payment_type>Cash</payment_type>
            <exchange_rate>394.6212398</exchange_rate>
            <fix_on_send>Y</fix_on_send>
            <credit_debit_card_details>
               <authorization_code/>
            </credit_debit_card_details>
            <duplicate_detection_flag>D</duplicate_detection_flag>
         </payment_details>
         <financials>
            <taxes>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <originators_principal_amount>34200</originators_principal_amount>
            <destination_principal_amount>13496100</destination_principal_amount>
            <gross_total_amount>34300</gross_total_amount>
            <plus_charges_amount>0</plus_charges_amount>
            <charges>100</charges>
            <message_charge>0</message_charge>
         </financials>
         <delivery_services>
            <code>000</code>
         </delivery_services>
         <mtcn>8182281338</mtcn>
         <new_mtcn>2430488182281338</new_mtcn>
         <foreign_remote_system>
            <identifier>WGHHKW0920T</identifier>
            <reference_no>TEST1234456789</reference_no>
            <counter_id>KW092PP0001A</counter_id>
         </foreign_remote_system>
      </ns2:send-money-store-request>
   </soap:Body>
</soap:Envelope>